# Data Input & Output

<img src="Data input and output.png" height= 500px width= 600px>

We will cover these...
    
    • CSV
    • Excel
    • HTML
    • SQL

In [1]:
import pandas as pd

## Read CSV

In [14]:
df = pd.read_csv('./DATA/example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### NOTE: 
If you do <font face="colonas" color="red" >id( pd.read_csv('./DATA/example') )</font>
<br>
### And do it again, it will CHANGE the id!

###

## Write CSV

In [15]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [16]:
df.to_csv('Generated.csv',index=True)

### Some thing(s) to note here:
    
    1 - index = False
                       will ignore the index and will not include in the 
                       generated file.
    2 - index = True
                       is default and will also include the indices in the
                       generated file.
                
    3 - The problem arises when we put, index = True. Which is the index header
        is not getting included in the generate filen ( see the screenshot )

<img src="Saved CSV.png" height=400px width=200px>        

        To avoid that, give it the name!
        
            >>>   df.index.names = ['RowHeader']
        After this, the header of row will be included.
        
        Hey, Aayush's Experimental Mind!!
                >>>    df.columns.names = ['CateGories']
                  
                "WILL NOT BE INCLUDED IN THE FILE IF YOU DO SO"



Thanks man!

### Reading and Writing Excel was easy (skipped)

###

### Reading HTML

In [31]:
data = pd.read_html("http://www.fdic.gov/bank/individual/failed/banklist.html")

In [32]:
data

[                             Bank Name               City  ST   CERT  \
 0                    Almena State Bank             Almena  KS  15426
 1           First City Bank of Florida  Fort Walton Beach  FL  16748
 2                 The First State Bank      Barboursville  WV  14361
 3                   Ericson State Bank            Ericson  NE  18265
 4     City National Bank of New Jersey             Newark  NJ  21111
 ..                                 ...                ...  ..    ...
 558                 Superior Bank, FSB           Hinsdale  IL  32646
 559                Malta National Bank              Malta  OH   6629
 560    First Alliance Bank & Trust Co.         Manchester  NH  34264
 561  National State Bank of Metropolis         Metropolis  IL   3815
 562                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                            Equity Bank   October 23, 2020
 1              United Fidelity Bank, fsb   October 16, 2020
 2                         MVB Bank, Inc.      April 3, 2020
 3             Farmers and Merchants Bank  February 14, 2020
 4                        Industrial Bank   November 1, 2019
 ..                                   ...                ...
 558                Superior Federal, FSB      July 27, 2001
 559                    North Valley Bank        May 3, 2001
 560  Southern New Hampshire Bank & Trust   February 2, 2001
 561              Banterra Bank of Marion  December 14, 2000
 562                   Bank of the Orient   October 13, 2000

 [563 rows x 6 columns]]

In [33]:
len(data)                                              # Number of Tables found in the webpage

1

In [34]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

#### Basically...

It tries to find the \<table> in the webpage given and returns the data inside of it.
<br>
If it fails to find ANY SINGLE table, then it raises an error.

Simple, and Beautiful.

##### Another thing...

• The conda install package-name listed above are not required here.
<br>
• As I am running the anaconda python, everything is included. Otherwise I might have to install the individual libraries to make <i> pd.read_html() </i> run properly.

###

###  SQL Read / Write ?
(Can we have function for SQL reading files?)
# #Ask Grras


<br>
<br>
<br>
That's it for data input and output.

Next, we will continue with the new section called <b> Pandas Excercises </b> .